#!/usr/bin/python
# -*- coding: utf-8 -*-
# The above encoding declaration is required and the file must be saved as UTF-8


################################################################################
### аргументами командного рядка

# Вони розділяються між собою пробілами. А, якщо в якості параметра нам 
# необхідно передати рядок з кількох слів, він береться у лапки.

# Щоб прочитати ці параметри з нашої програми, необхідно підключити модуль 
# (ще одну бібліотеку функцій) sys. Він містить багато всього, 
# але нас буде цікавити лише його змінна sys.argv, 
# в якій зберігаються аргументи командного рядка, з якими запущено програму. 

import sys
x = int(sys.argv[1])
y = int(sys.argv[2])
print x + y
