#!/usr/bin/python
# -*- coding: utf-8 -*-
# The above encoding declaration is required and the file must be saved as UTF-8


################################################################################
"""
Програма має бути записана в окремому файлі, який може виконуватися консольною
командою python <ім'я файлу>. Для тестування ваших розв'язків будуть
використовуватися різні комбінації вхідних значень, які подаватимуться у вигляді
аргументів командного рядка при виклику програми. Результат обчислень має
виводитися на екран командою print.

Вхідні дані: 2 невід'ємних дійсних числа a та b - аргументи командного рядка.
  b не дорівнює 0.
Вихідні дані: дійсне число - результат обчислення формули

Приклад:
Вхідні дані: 0 1
Приклад виклику: python test.py 0 1
Результат: 0.0
Вхідні дані: 0.5 10
Приклад виклику: python test.py 0.5 10
Результат: 0.688209837593
"""

import math
import sys

a = float(sys.argv[1])
b = float(sys.argv[2])
result = math.sqrt(a*b) / (math.pow( math.e, a) * b) + a * math.pow(math.e, 2*a/b)
print result
