#!/usr/bin/python
# -*- coding: utf-8 -*-
# The above encoding declaration is required and the file must be saved as UTF-8


################################################################################

# Практичне завдання № 3.2

# Програма має розраховувати числа послідовності Фібоначчі.
# Послідовність Фібоначчі - це послідовність чисел, в якій кожний елемент
# дорівнює сумі двох попередніх. При цьому нульовий елемент вважається
# за 0, а перший 1.
# Отже, сама послідовність виглядає наступним чином:
# 0, 1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89, 144, 233, 377, 610, 987, 1597, 2584, 4181, 6765, 10946, …

# Вхідні дані: ціле невід'ємне число n. (Передається в програму як аргумент командного рядка.)
# Результат роботи: значення n-го числа послідовності Фібоначчі.
# Будь ласка, не використовуйте рекурсію.

# Наприклад
# Вхідні дані: 0
# Приклад виклику: python lab3_2.py 0
# Результат: 0
# Вхідні дані: 10
# Приклад виклику: python lab3_2.py 10
# Результат: 55

import sys

endOfLoop = int(sys.argv[1])
n = 0
result = 0
collection = [0, 1]

if endOfLoop < 0:
    print "Введіть будь ласка ціле додатнє число!"
    sys.exit()

for n in range(collection):
    result = result + (n-1)
    print result


